Revit 2024 API
BRepBuilder.AllowRemovalOfProblematicFaces Method
 Allow BRepBuilder to remove problematic faces (e.g., due to inaccurate edge geometry). If this option is enabled and BRepBuilder removes some faces, the output geometry's type will be OpenShell regardless of the expected type specified when the BRepBuilder was created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017_subscription_update
Syntax
C#
public void AllowRemovalOfProblematicFaces()
Visual Basic
Public Sub AllowRemovalOfProblematicFaces
Visual C++
public:
void AllowRemovalOfProblematicFaces()
See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace